Repository: Azimuth-IQ/Azimuth-VMS
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Image uploaded successfully!
ar: تم تحميل الصورة بنجاح!

# uploadFailed
source: Upload failed: {error}
ar: فشل التحميل: {error}

# titleAndImageRequired
source: Title and Image URL are required
ar: العنوان وعنوان URL للصورة مطلوبان

source: Invalid Image URL
ar: عنوان URL للصورة غير صالح

source: Visible to Users
ar: مرئي للمستخدمين

source: Rating Criteria Management
ar: إدارة معايير التقييم

source: Event Workflow
ar: سير عمل الفعالية

source: Planning
ar: التخطيط

source: Event created and scheduled
ar: تم إنشاء وجدولة الفعالية

# eventInPlanningPhase
source: Event is in planning phase. You can assign shifts and volunteers.
ar: الفعالية في مرحلة التخطيط. يمكنك تعيين النوبات والمتطوعين.

source: Event is currently running
ar: الفعالية قيد التنفيذ حالياً

# eventIsActive
source: Event is active. Volunteers can check in/out.
ar: الفعالية نشطة. يمكن للمتطوعين تسجيل الحضور والانصراف.

source: Event date has passed
ar: انتهى تاريخ الفعالية

# eventHasEnded
source: Event has ended. You can review attendance and feedback.
ar: انتهت الفعالية. يمكنك مراجعة الحضور والملاحظات.

source: Event is archived
ar: الفعالية مؤرشفة

# eventIsArchivedHidden
source: Event is archived and hidden from main lists.
ar: الفعالية مؤرشفة ومخفية عن القوائم الرئيسية.

source: Closed
ar: مغلق

source: Submitted: {date}
ar: تاريخ التقديم: {date}

# reviewedBy
source: Reviewed by: {name}
ar: تمت المراجعة بواسطة: {name}

source: Update Status
ar: تحديث الحالة

source: Update Feedback Status
ar: تحديث حالة التعليقات

# statusColon
source: Status:
ar: الحالة:

source: Resolution Notes (optional):
ar: ملاحظات الحل (اختياري):

source: Feedback updated successfully
ar: تم تحديث التعليقات بنجاح

source: Delete Feedback
ar: حذف التعليقات

# deleteFeedbackConfirmation
source: Are you sure you want to delete this feedback? This action cannot be undone.
ar: هل أنت متأكد من حذف هذه التعليقات؟ لا يمكن التراجع عن هذا الإجراء.

source: Feedback deleted successfully
ar: تم حذف التعليقات بنجاح

source: Reassign Location
ar: إعادة تعيين الموقع

# eventColon
source: Event: {name}
ar: الفعالية: {name}

# shiftTimeRange
source: Shift: {start} - {end}
ar: النوبة: {start} - {end}

source: Select new location:
ar: اختر موقعاً جديداً:

# mainLocationColon
source: Main Location: {name}
ar: الموقع الرئيسي: {name}

# sublocationsColon
source: Sublocations:
ar: المواقع الفرعية:

source: Reassign
ar: إعادة التعيين

source: Please select a role
ar: الرجاء اختيار دور

source: Please select a team
ar: الرجاء اختيار فريق

source: Please select an event
ar: الرجاء اختيار فعالية

# noUsersFoundForAudience
source: No users found for selected audience
ar: لم يتم العثور على مستخدمين للجمهور المحدد

# notificationSentToUsers
source: Notification sent to {count} user(s)
ar: تم إرسال الإشعار إلى {count} مستخدم

# errorSendingNotifications
source: Error sending notifications: {error}
ar: خطأ في إرسال الإشعارات: {error}

source: Notification Type
ar: نوع الإشعار

source: Title
ar: العنوان

source: Message
ar: الرسالة

source: Send To
ar: إرسال إلى

source: All Users
ar: جميع المستخدمين

source: By Role
ar: حسب الدور

source: By Team
ar: حسب الفريق

source: Event Participants
ar: المشاركون في الفعالية

source: Select Role
ar: اختر الدور

source: Choose a role
ar: اختر دوراً

source: Choose a team
ar: اختر فريقاً

source: Choose an event
ar: اختر فعالية

# sendNotificationsToGroups
source: Send notifications to specific groups of users in the system
ar: إرسال إشعارات إلى مجموعات محددة من المستخدمين في النظام

source: No events available
ar: لا توجد فعاليات متاحة

# chooseEventToViewFeedback
source: Choose an event to view feedback
ar: اختر فعالية لعرض التعليقات

# selectEventToViewFeedback
source: Select an event to view feedback
ar: اختر فعالية لعرض التعليقات

# noFeedbackReceivedYet
source: No feedback received for this event yet
ar: لم يتم استلام تعليقات لهذه الفعالية بعد

# errorLoadingAverages
source: Error loading averages: {error}
ar: خطأ في تحميل المتوسطات: {error}

# individualFeedback
source: Individual Feedback ({count})
ar: تعليقات فردية ({count})

source: Overall Rating
ar: التقييم العام

# basedOnResponses
source: Based on {count} response{plural}
ar: بناءً على {count} استجابة{plural}

# errorLoadingForms
source: Error loading forms: {error}
ar: خطأ في تحميل النماذج: {error}

# syncedVolunteersWithForms
source: Synced {count} volunteer(s) with their forms
ar: تمت مزامنة {count} متطوع مع نماذجهم

source: Volunteer Forms Management
ar: إدارة نماذج المتطوعين

source: New Form
ar: نموذج جديد

source: Filter by status:
ar: التصفية حسب الحالة:

source: All Statuses
ar: جميع الحالات

# createNewFormToGetStarted
source: Create a new form to get started
ar: أنشئ نموذجاً جديداً للبدء

# documentsColon
source: Documents:
ar: المستندات:

source: Form #{number}
ar: نموذج #{number}

# statusUpdatedButErrorCreatingAccount
source: Status updated but error creating account: {error}
ar: تم تحديث الحالة ولكن حدث خطأ في إنشاء الحساب: {error}

source: Enter notification title
ar: أدخل عنوان الإشعار

source: Enter notification message
ar: أدخل رسالة الإشعار

# archiveItem
source: Archive {itemType}?
ar: أرشفة {itemType}؟

source: Unarchive
ar: إلغاء الأرشفة

# unarchiveItem
source: Unarchive {itemType}?
ar: إلغاء أرشفة {itemType}؟

# deleteItem
source: Delete {itemType}?
ar: حذف {itemType}؟

# confirmArchiveItem
source: Are you sure you want to archive "{itemName}"?
ar: هل أنت متأكد من أرشفة "{itemName}"؟

# confirmUnarchiveItem
source: Are you sure you want to restore "{itemName}" to active status?
ar: هل أنت متأكد من استعادة "{itemName}" إلى الحالة النشطة؟

# confirmDeleteItem
source: Are you sure you want to permanently delete "{itemName}"?
ar: هل أنت متأكد من حذف "{itemName}" نهائياً؟

# archiveWarning
source: This will hide the {itemType} from active lists but keep all data intact.
ar: سيؤدي هذا إلى إخفاء {itemType} من القوائم النشطة مع الاحتفاظ بجميع البيانات.

# deleteWarning
source: This action cannot be undone. All data associated with this {itemType} will be permanently removed.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم إزالة جميع البيانات المرتبطة بـ {itemType} نهائياً.

# deleteWarningGeneric
source: This action cannot be undone! All associated data will be permanently deleted.
ar: لا يمكن التراجع عن هذا الإجراء! سيتم حذف جميع البيانات المرتبطة نهائياً.

source: Show Archived
ar: عرض المؤرشف

# errorOccurred
source: Error occurred: {error}
ar: حدث خطأ: {error}

source: Mark all read
ar: تعليم الكل كمقروء

source: Error loading notifications
ar: خطأ في تحميل الإشعارات

source: No notifications yet
ar: لا توجد إشعارات حتى الآن

# notificationsWillAppearHere
source: You'll see notifications here when you get them
ar: ستظهر الإشعارات هنا عند استلامها

source: Notification deleted
ar: تم حذف الإشعار

source: Check 1: Departure
ar: الفحص الأول: المغادرة

source: Check 2: Arrival
ar: الفحص الثاني: الوصول

source: Select an event to start presence check
ar: اختر حدثاً لبدء فحص الحضور

source: Admin Only
ar: مدير فقط

source: TL Only
ar: قائد فقط

source: Both
ar: كلاهما

source: No volunteers assigned to this event
ar: لا توجد متطوعين مخصصين لهذا الحدث

source: Departure Check (On Bus)
ar: فحص المغادرة (في الحافلة)

source: Arrival Check (On Location)
ar: فحص الوصول (في الموقع)

source: EXCUSED (Leave Approved)
ar: معذور (تم الموافقة على الإجازة)

source: Present
ar: حاضر

# presentUpper
source: PRESENT
ar: حاضر

source: Absent
ar: غائب

# absentUpper
source: ABSENT
ar: غائب

source: Mark Absent
ar: تعليم كغائب

source: Mark Present
ar: تعليم كحاضر

source: Not Checked
ar: لم يتم الفحص

source: Excused
ar: معذور

# errorMarkingAttendance
source: Error marking attendance: {error}
ar: خطأ في تسجيل الحضور: {error}

source: Select an event and shift to assign volunteers
ar: اختر حدثاً ووردية لتعيين المتطوعين

# pleaseSelectEventShiftAndLocationFirst
source: Please select an event, shift, and location first
ar: يرجى اختيار حدث ووردية وموقع أولاً

source: No approved volunteers available
ar: لا يوجد متطوعون معتمدون متاحون

# assignedVolunteersToSubLocation
source: Assigned {count} volunteers to sublocation successfully
ar: تم تعيين {count} متطوع للموقع الفرعي بنجاح

# errorCreatingAssignments
source: Error creating assignments: {error}
ar: خطأ في إنشاء التعيينات: {error}

source: Choose location to assign volunteers
ar: اختر موقعاً لتعيين المتطوعين

source: Select a location
ar: اختر موقعاً

source: Assign Volunteers to Location
ar: تعيين متطوعين للموقع

source: assigned
ar: معين

source: No volunteers assigned yet
ar: لم يتم تعيين متطوعين بعد

source: Team leaders should assign first
ar: يجب على قادة الفرق التعيين أولاً

# mainSuffix
source: (Main)
ar: (رئيسي)

source: Unknown Sublocation
ar: موقع فرعي غير معروف

source: Selected: {count}
ar: المحدد: {count}

source: Event
ar: الحدث

# errorReassigningLocation
source: Error reassigning location: {error}
ar: خطأ في إعادة تعيين الموقع: {error}

source: Contact admin to assign your team to events
ar: اتصل بالمسؤول لتعيين فريقك للأحداث

source: Select a shift to assign volunteers
ar: اختر وردية لتعيين المتطوعين

source: No team assigned to this location
ar: لا يوجد فريق معين لهذا الموقع

source: No approved volunteers available in your team
ar: لا يوجد متطوعون معتمدون متاحون في فريقك

source: Choose which location to assign your team members to:
ar: اختر الموقع الذي تريد تعيين أعضاء فريقك له:

source: Request Leave
ar: طلب إجازة

source: User not authenticated
ar: المستخدم غير مصادق عليه

source: Leave request submitted successfully
ar: تم تقديم طلب الإجازة بنجاح

source: Reason for Leave Request
ar: سبب طلب الإجازة

# provideDetailedReasonForLeave
source: Please provide a detailed reason for your leave request. This will help your team leader make an informed decision.
ar: يرجى تقديم سبب مفصل لطلب الإجازة. سيساعد هذا قائد فريقك على اتخاذ قرار مستنير.

source: Enter your reason here...
ar: أدخل سببك هنا...

source: Please provide a reason
ar: يرجى تقديم السبب

# pleaseProvideMoreDetailedReason
source: Please provide a more detailed reason (at least 10 characters)
ar: يرجى تقديم سبب أكثر تفصيلاً (10 أحرف على الأقل)

# teamLeaderWillReviewRequest
source: Your team leader will review this request. You will be notified of their decision.
ar: سيقوم قائد فريقك بمراجعة هذا الطلب. سيتم إخطارك بقرارهم.

source: Submitting...
ar: جاري الإرسال...

source: Submit Request
ar: تقديم الطلب

# dateLabel
source: Date
ar: التاريخ

# shiftTimeLabel
source: Shift Time
ar: وقت المناوبة

source: No events assigned to you
ar: لا توجد فعاليات مخصصة لك

# contactTeamLeaderToBeAssignedToEvents
source: Contact your team leader to be assigned to events
ar: اتصل بقائد فريقك ليتم تعيينك للفعاليات

source: View on Map
ar: عرض على الخريطة

source: Submit Event Feedback
ar: تقديم تقييم الحدث

# contactLabel
source: Contact: {phone}
ar: الاتصال: {phone}

# yourShift
source: Your shift: {shiftId}
ar: مناوبتك: {shiftId}

# locationField
source: Location: {location}
ar: الموقع: {location}

source: Not assigned
ar: غير مخصص

source: Rate Your Experience
ar: قيّم تجربتك

# rateEventManagementAspects
source: Please rate the following aspects of the event management (1 = Poor, 5 = Excellent)
ar: يرجى تقييم الجوانب التالية لإدارة الفعالية (1 = ضعيف، 5 = ممتاز)

source: Additional Comments (Optional)
ar: تعليقات إضافية (اختياري)

# shareAnyAdditionalThoughts
source: Share any additional thoughts or suggestions...
ar: شارك أي أفكار أو اقتراحات إضافية...

# thankYouForFeedback
source: Thank you for your feedback!
ar: شكراً لملاحظاتك!

source: Poor
ar: ضعيف

source: Fair
ar: مقبول

source: Good
ar: جيد

source: Very Good
ar: جيد جداً

source: Excellent
ar: ممتاز

# imageSizeExceedsLimit
source: Image size should not exceed 500 KB.
ar: يجب ألا يتجاوز حجم الصورة 500 كيلوبايت.

source: Form submitted for review!
ar: تم تقديم النموذج للمراجعة!

source: Download PDF
ar: تحميل PDF

source: Ready to print!
ar: جاهز للطباعة!

# errorLabel
source: Error
ar: خطأ

source: Sublocation
ar: الموقع الفرعي

source: Organization & Planning
ar: التنظيم والتخطيط

# howWellWasEventOrganized
source: How well was the event organized and planned?
ar: كيف كان مستوى تنظيم وتخطيط الفعالية؟

source: Logistics & Resources
ar: اللوجستيات والموارد

# wereResourcesAdequatelyProvided
source: Were resources and logistics adequately provided?
ar: هل تم توفير الموارد واللوجستيات بشكل كافٍ؟

source: Communication
ar: التواصل

# howEffectiveWasCommunication
source: How effective was the communication before and during the event?
ar: ما مدى فعالية التواصل قبل وأثناء الفعالية؟

# howWellWasEventManaged
source: How well was the event managed overall?
ar: كيف كانت إدارة الفعالية بشكل عام؟

# shareYourThoughts
source: Share your thoughts, suggestions, or any issues you experienced...
ar: شارك أفكارك أو اقتراحاتك أو أي مشاكل واجهتها...

source: My Schedule
ar: جدولي

# errorLoadingSchedule
source: Error loading schedule: {error}
ar: خطأ في تحميل الجدول: {error}

# selectDayToViewAssignments
source: Select a day to view assignments
ar: اختر يوماً لعرض التكليفات

# noShiftsOn
source: No shifts on {date}
ar: لا توجد مناوبات في {date}

# locationId
source: Location ID: {id}
ar: معرف الموقع: {id}

source: Performance Score
ar: درجة الأداء

source: Based on IHS Criteria
ar: بناءً على معايير IHS

source: Personal Information
ar: المعلومات الشخصية

source: Education
ar: التعليم

source: Birth Date
ar: تاريخ الميلاد

source: Profession
ar: المهنة

source: Job Title
ar: المسمى الوظيفي

source: Department
ar: القسم

# notApplicable
source: N/A
ar: غير متوفر

source: NEXT SHIFT
ar: المناوبة القادمة

source: Unknown Location
ar: موقع غير معروف

# provideYourFeedback
source: Provide your feedback about this event
ar: قدم تقييمك حول هذا الحدث

source: How was your experience?
ar: كيف كانت تجربتك؟

# pleaseSelectRating
source: Please select a rating
ar: الرجاء اختيار التقييم

source: Your Feedback
ar: تقييمك

# shareFeedbackDetails
source: Share your feedback details here...
ar: شارك تفاصيل تقييمك هنا...

# pleaseProvideFeedback
source: Please provide your feedback
ar: الرجاء تقديم تقييمك

# feedbackSubmittedSuccessfully
source: Thank you! Your feedback has been submitted successfully.
ar: شكراً! تم تقديم تقييمك بنجاح.

# failedToSubmitFeedback
source: Failed to submit feedback: {error}
ar: فشل تقديم التقييم: {error}

source: Event Details
ar: تفاصيل الحدث

source: Select Language
ar: اختر اللغة

# areYouSureSignOut
source: Are you sure you want to sign out?
ar: هل أنت متأكد من تسجيل الخروج؟

# shareFeedbackPrompt
source: Share your feedback, report bugs, or suggest improvements to help us make the system better.
ar: شارك ملاحظاتك، أبلغ عن الأخطاء، أو اقترح تحسينات لمساعدتنا في تحسين النظام.

# describeFeedbackDetail
source: Describe the issue, bug, or suggestion in detail...
ar: صف المشكلة أو الخطأ أو الاقتراح بالتفصيل...

# pleaseEnterFeedback
source: Please enter your feedback
ar: الرجاء إدخال ملاحظاتك

# provideMoreDetails
source: Please provide more details (at least 10 characters)
ar: الرجاء تقديم المزيد من التفاصيل (10 أحرف على الأقل)

source: My Previous Feedback
ar: ملاحظاتي السابقة

# errorLoadingFeedback
source: Error loading feedback: {error}
ar: خطأ في تحميل الملاحظات: {error}

# noFeedbackYet
source: You haven't submitted any feedback yet
ar: لم تقدم أي ملاحظات بعد

source: Admin Response:
ar: رد المسؤول:
