Repository: Azimuth-IQ/Azimuth-VMS
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: VMS
ar: نظام إدارة المتطوعين

source: Welcome
ar: مرحباً

source: Search
ar: بحث

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Add
ar: إضافة

source: Update
ar: تحديث

source: Submit
ar: إرسال

source: Close
ar: إغلاق

source: Confirm
ar: تأكيد

source: Back
ar: رجوع

source: Next
ar: التالي

source: Previous
ar: السابق

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Success
ar: نجح

source: Sign Out
ar: تسجيل الخروج

source: Sign In
ar: تسجيل الدخول

source: Change Password
ar: تغيير كلمة المرور

source: Yes
ar: نعم

source: No
ar: لا

source: OK
ar: موافق

source: Retry
ar: إعادة المحاولة

source: Upload
ar: رفع

source: Uploaded
ar: تم الرفع

source: Download
ar: تحميل

source: Print
ar: طباعة

source: Select
ar: اختيار

source: Selected
ar: محدد

source: Assign
ar: تعيين

source: Approve
ar: موافقة

source: Reject
ar: رفض

source: Pending
ar: قيد الانتظار

source: Approved
ar: مقبول

source: Rejected
ar: مرفوض

source: Completed
ar: مكتمل

source: ACTIVE
ar: نشط

source: Inactive
ar: غير نشط

source: Send
ar: إرسال

source: View
ar: عرض

source: Refresh
ar: تحديث

source: Dashboard
ar: لوحة التحكم

source: Home
ar: الرئيسية

source: Events
ar: الفعاليات

source: Volunteers
ar: المتطوعون

source: Leaders
ar: القادة

source: Team Leaders
ar: قادة الفرق

source: Teams
ar: الفرق

source: Locations
ar: المواقع

source: Notifications
ar: الإشعارات

source: Send Notif
ar: إرسال إشعار

source: Send Notification
ar: إرسال إشعار

source: Sending...
ar: جاري الإرسال...

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

# welcomeBack
source: Welcome back, {userPhone}
ar: مرحباً بك، {userPhone}

source: Analytics
ar: التحليلات

source: Quick Actions
ar: إجراءات سريعة

source: Workflow Scenarios
ar: سيناريوهات سير العمل

source: Active Events
ar: الفعاليات النشطة

# volunteersPerTeam
source: Volunteers per Team (Top 5)
ar: المتطوعون لكل فريق (أفضل 5)

source: No active events
ar: لا توجد فعاليات نشطة

source: Activity
ar: النشاط

source: Actions
ar: الإجراءات

source: Activity Overview
ar: نظرة عامة على النشاط

# shiftsCompletedLast6Months
source: Shifts completed in last 6 months
ar: الورديات المكتملة في آخر 6 أشهر

source: Management
ar: الإدارة

source: Manage Shifts
ar: إدارة الورديات

source: Assign volunteers to shifts
ar: تعيين المتطوعين للورديات

source: Presence Checks
ar: فحوصات الحضور

source: Check volunteer attendance
ar: فحص حضور المتطوعين

source: Review volunteer leave requests
ar: مراجعة طلبات إجازة المتطوعين

source: Report bugs or suggest ideas
ar: الإبلاغ عن الأخطاء أو اقتراح أفكار

# noEventsAssignedYet
source: No events assigned to your teams yet
ar: لا توجد فعاليات معينة لفرقك بعد

# errorLoadingData
source: Error loading data: {error}
ar: خطأ في تحميل البيانات: {error}

source: Team Leader Dashboard
ar: لوحة تحكم قائد الفريق

source: My Events
ar: فعالياتي

# shiftsAssigned
source: {count} Shift{plural} Assigned
ar: {count} وردية{plural} معينة

source: No shifts assigned to your teams
ar: لا توجد ورديات معينة لفرقك

source: Main Shift
ar: الوردية الرئيسية

source: SubLocation
ar: موقع فرعي

# membersAssigned
source: {assigned}/{total} members assigned
ar: {assigned}/{total} أعضاء معينين

source: No team members available
ar: لا يوجد أعضاء فريق متاحون

source: Member assigned
ar: تم تعيين العضو

source: Member removed
ar: تم إزالة العضو

source: Member assigned to sublocation
ar: تم تعيين العضو للموقع الفرعي

source: Member removed from sublocation
ar: تم إزالة العضو من الموقع الفرعي

# activeEventsCount
source: Active Events
ar: الفعاليات النشطة

# volunteersCount
source: Volunteers
ar: المتطوعون

# teamLeadersCount
source: Team Leaders
ar: قادة الفرق

# notificationsCount
source: Notifications
ar: الإشعارات

source: Shift Assignment
ar: تعيين الورديات

source: Presence Check
ar: تسجيل الحضور

source: Forms Mgmt
ar: إدارة النماذج

source: Carousel Mgmt
ar: إدارة العروض

source: Ratings
ar: التقييمات

source: Leave Requests
ar: طلبات الإجازة

source: System Feedback
ar: ملاحظات النظام

source: Event Feedback
ar: ملاحظات الفعالية

source: Volunteer Registration
ar: تسجيل المتطوعين

# volunteerRegistrationDescription
source: Manage new sign-ups, review forms, and approve volunteers.
ar: سير عمل كامل لتأهيل المتطوعين الجدد بما في ذلك تقديم النموذج والمراجعة والموافقة

source: Event Management
ar: إدارة الفعالية

# eventManagementDescription
source: Create events, assign shifts, and manage attendance.
ar: إنشاء الفعاليات، تعيين الورديات، وإدارة الحضور.

source: Start Workflow
ar: بدء سير العمل

source: members
ar: أعضاء

source: Volunteer Workflow
ar: سير عمل المتطوع

# statusUpdatedTo
source: Status updated to {status}
ar: تم تحديث الحالة إلى {status}

source: Sent
ar: تم الإرسال

source: Waiting for volunteer to fill data
ar: في انتظار المتطوع لملء البيانات

# formLinkSent
source: Form link has been sent to the volunteer.
ar: تم إرسال رابط النموذج إلى المتطوع.

source: Pending Review
ar: قيد المراجعة

# adminChecksForm
source: Admin checks form and attachments
ar: المسؤول يراجع النموذج والمرفقات

# pleaseReviewForm
source: Please review the form data and attachments.
ar: يرجى مراجعة بيانات النموذج والمرفقات.

source: View Form
ar: عرض النموذج

source: Generating PDF...
ar: جاري إنشاء ملف PDF...

source: PDF Downloaded
ar: تم تحميل ملف PDF

source: Initial Approval
ar: الموافقة الأولية

source: First level approval
ar: الموافقة من المستوى الأول

# formPassedInitialReview
source: Form has passed initial review.
ar: اجتاز النموذج المراجعة الأولية.

source: Approve (L1)
ar: موافقة (م1)

source: Final Approval
ar: الموافقة النهائية

source: Second level approval
ar: الموافقة من المستوى الثاني

# formPassedFinalReview
source: Form has passed final review.
ar: اجتاز النموذج المراجعة النهائية.

source: Approve (L2)
ar: موافقة (م2)

source: Process finished
ar: انتهت العملية

# volunteerRegistrationComplete
source: Volunteer registration is complete.
ar: اكتمل تسجيل المتطوع.

source: Complete
ar: إكمال

source: Re-evaluate
ar: إعادة التقييم

source: Volunteer Dashboard
ar: لوحة تحكم المتطوع

source: Redirecting to form...
ar: جاري التوجيه إلى النموذج...

source: My Assignments
ar: تكليفاتي

source: Upcoming Shift
ar: المناوبة القادمة

# noUpcomingShifts
source: No upcoming shifts assigned.
ar: لا توجد ورديات قادمة معينة.

source: Application Under Review
ar: الطلب قيد المراجعة

# applicationUnderReviewDesc
source: Your volunteer application has been submitted and is currently under review. You will be notified once a decision has been made.
ar: تم تقديم طلب التطوع الخاص بك وهو قيد المراجعة حاليًا. سيتم إعلامك بمجرد اتخاذ القرار.

# firstLevelApprovalTitle
source: First Level Approval
ar: الموافقة من المستوى الأول

# firstLevelApprovalDesc
source: Your application has been approved at the first level. Waiting for final approval.
ar: تمت الموافقة على طلبك في المستوى الأول. في انتظار الموافقة النهائية.

source: Fully Approved
ar: تمت الموافقة بالكامل

# fullyApprovedDesc
source: Congratulations! Your application has been fully approved.
ar: تهانينا! تمت الموافقة على طلبك بالكامل.

source: Active Volunteer
ar: متطوع نشط

# activeVolunteerDesc
source: You are an active volunteer in the system.
ar: أنت متطوع نشط في النظام.

source: Application Rejected
ar: تم رفض الطلب

# applicationRejectedFirstStage
source: Your application was rejected at the first review stage.
ar: تم رفض طلبك في مرحلة المراجعة الأولى.

# applicationRejectedFinalStage
source: Your application was rejected at the final review stage.
ar: تم رفض طلبك في مرحلة المراجعة النهائية.

# errorLoadingInfo
source: Error loading your information. Please try again.
ar: حدث خطأ أثناء تحميل معلوماتك. يرجى المحاولة مرة أخرى.

# noVolunteerFormFound
source: No volunteer form found. Please contact support.
ar: لم يتم العثور على نموذج متطوع. يرجى الاتصال بالدعم.

source: My Schedule & Locations
ar: جدولي والمواقع

# viewUpcomingShifts
source: View your upcoming shifts, times, and locations
ar: عرض المناوبات القادمة والأوقات والمواقع

source: My Profile
ar: ملفي الشخصي

# viewRatingAndInfo
source: View your rating and personal info
ar: عرض تقييمك ومعلوماتك الشخصية

source: Submit Feedback
ar: تقديم الملاحظات

# reportBugsOrSuggest
source: Report bugs or suggest improvements
ar: الإبلاغ عن الأخطاء أو اقتراح تحسينات

# welcomeBackName
source: Welcome back,
ar: مرحبًا بعودتك،

source: Volunteer
ar: متطوع

source: Events Management
ar: إدارة الفعاليات

source: Create Event
ar: إنشاء فعالية

source: Edit Event
ar: تعديل الفعالية

source: Delete Event
ar: حذف الفعالية

source: Event Name
ar: اسم الفعالية

# eventNameRequired
source: Event Name *
ar: اسم الفعالية *

source: Please enter event name
ar: يرجى إدخال اسم الفعالية

source: Event Description
ar: وصف الفعالية

source: Description
ar: الوصف

source: Start Date
ar: تاريخ البدء

# startDateRequired
source: Start Date *
ar: تاريخ البدء *

source: End Date
ar: تاريخ الانتهاء

# endDateRequired
source: End Date *
ar: تاريخ الانتهاء *

source: Required
ar: مطلوب

# dateFormatHint
source: DD-MM-YYYY
ar: يوم-شهر-سنة

# eventCreated
source: Event created successfully
ar: تم إنشاء الفعالية بنجاح

# eventUpdated
source: Event updated successfully
ar: تم تحديث الفعالية بنجاح

# eventDeleted
source: Event deleted successfully
ar: تم حذف الفعالية بنجاح

# noEvents
source: No events found
ar: لا توجد فعاليات

source: No archived events
ar: لا توجد فعاليات مؤرشفة

# noActiveEventsFound
source: No active events found. Tap + to add a new event.
ar: لا توجد فعاليات نشطة. اضغط + لإضافة فعالية جديدة.

source: Select Event
ar: اختر الحدث

source: View Workflow
ar: عرض سير العمل

source: Archived
ar: مؤرشف

source: restored
ar: تم الاستعادة

source: deleted
ar: تم الحذف

source: Add New Event
ar: إضافة فعالية جديدة

source: Recurring Event
ar: فعالية متكررة

source: Recurrence Type
ar: نوع التكرار

# recurrenceTypeRequired
source: Recurrence Type *
ar: نوع التكرار *

# recurrenceEndDate
source: Recurrence End Date (Optional)
ar: تاريخ انتهاء التكرار (اختياري)

source: Recurrence
ar: التكرار

source: Presence Check Permissions
ar: صلاحيات فحص الحضور

# presenceCheckPermissionsRequired
source: Presence Check Permissions *
ar: صلاحيات فحص الحضور *

source: To
ar: إلى

source: Shifts
ar: الورديات

source: Shift Time
ar: وقت المناوبة

source: Start Time
ar: وقت البدء

source: End Time
ar: وقت الانتهاء

source: Shift
ar: الوردية

# noShifts
source: No shifts available
ar: لا توجد ورديات متاحة

source: No shifts added
ar: لم تتم إضافة ورديات

# selectShift
source: Select a shift
ar: اختر وردية

source: Add Shift
ar: إضافة وردية

source: Location
ar: الموقع

# locationColon
source: Location:
ar: الموقع:

# subLocationRequired
source: SubLocation *
ar: الموقع الفرعي *

source: Add SubLocation
ar: إضافة موقع فرعي

source: Edit SubLocation
ar: تعديل الموقع الفرعي

source: This location has no sublocations
ar: هذا الموقع ليس لديه مواقع فرعية

# pleaseSelectSublocation
source: Please select a sublocation
ar: يرجى اختيار موقع فرعي

source: Team Assignment
ar: تعيين الفريق

source: Existing
ar: موجود

source: Temporary
ar: مؤقت

source: Team (Optional)
ar: الفريق (اختياري)

source: Select Team
ar: اختر الفريق

source: None
ar: لا شيء

source: Temporary Team
ar: فريق مؤقت

source: Create
ar: إنشاء

source: Create Team
ar: إنشاء فريق

source: Create Temporary Team
ar: إنشاء فريق مؤقت

source: Leader
ar: القائد

# leaderColon
source: Leader: {id}
ar: القائد: {id}

# membersColon
source: Members:
ar: الأعضاء:

source: Team Members
ar: أعضاء الفريق

# teamMembersColon
source: Team Members:
ar: أعضاء الفريق:

# tapPlusToAddFirstTeamLeader
source: Tap + to add a new team leader
ar: اضغط + لإضافة قائد فريق جديد

source: No members
ar: لا يوجد أعضاء

source: No temporary team created
ar: لم يتم إنشاء فريق مؤقت

source: Select Team Member
ar: اختر عضو الفريق

# addMember
source: Add
ar: إضافة

source: Select Days:
ar: اختر الأيام:

source: Day of Month
ar: يوم من الشهر

# dayOfMonthRequired
source: Day of Month *
ar: يوم من الشهر *

# selectDayHint
source: Select day (1-31)
ar: اختر اليوم (1-31)

source: Day
ar: اليوم

# dayRequired
source: Day *
ar: اليوم *

source: Day {number}
ar: اليوم {number}

# pleaseSelectDay
source: Please select a day
ar: يرجى اختيار اليوم

source: Month
ar: الشهر

# monthRequired
source: Month *
ar: الشهر *

# pleaseSelectMonth
source: Please select a month
ar: يرجى اختيار الشهر

source: Team Leaders Management
ar: إدارة قادة الفرق

source: Add Team Leader
ar: إضافة قائد فريق

source: Edit Team Leader
ar: تعديل قائد الفريق

source: Delete Team Leader
ar: حذف قائد الفريق

# noTeamLeaders
source: No team leaders found
ar: لا يوجد قادة فرق

# tapPlusToAddTeamLeader
source: Tap + to add a new team leader
ar: اضغط + لإضافة قائد فريق جديد

# teamLeaderArchived
source: {name} archived
ar: تم أرشفة {name}

# teamLeaderRestored
source: {name} restored
ar: تم استعادة {name}

# teamLeaderDeleted
source: {name} deleted
ar: تم حذف {name}

source: Teams Management
ar: إدارة الفرق

source: Add Team
ar: إضافة فريق

source: Edit Team
ar: تعديل الفريق

source: Delete Team
ar: حذف الفريق

source: Team Name
ar: اسم الفريق

# noTeams
source: No teams found
ar: لا توجد فرق

source: Locations Management
ar: إدارة المواقع

source: Add Location
ar: إضافة موقع

source: Edit Location
ar: تعديل الموقع

source: Delete Location
ar: حذف الموقع

source: Location Name
ar: اسم الموقع

source: Main Location
ar: الموقع الرئيسي

# noLocations
source: No locations found
ar: لا توجد مواقع

source: Select Location
ar: اختر الموقع

source: Assign My Team
ar: تعيين فريقي

source: Unable to identify current user
ar: تعذر تحديد المستخدم الحالي

source: No events assigned to your teams
ar: لا توجد أحداث معينة لفرقك

# contactAdminToAssignYourTeam
source: Contact admin to assign your team to events
ar: اتصل بالمسؤول لتعيين فريقك للفعاليات

# selectEventAndShift
source: Select Event & Shift
ar: اختر الحدث والوردية

source: Events where your team is assigned
ar: الأحداث التي تم تعيين فريقك لها

source: Select Location to Assign
ar: اختر الموقع للتعيين

# chooseLocationToAssignTeam
source: Choose which location to assign your team members to:
ar: اختر الموقع الذي تريد تعيين أعضاء فريقك له:

source: Assign Volunteers
ar: تعيين المتطوعين

source: Current Assignments
ar: التعيينات الحالية

source: By:
ar: بواسطة:

source: Select Volunteers
ar: اختر المتطوعين

# pleaseSelectEventShiftLocation
source: Please select an event, shift, and location first
ar: يرجى اختيار فعالية ووردية وموقع أولاً

# noTeamAssignedToLocation
source: No team assigned to this location
ar: لا يوجد فريق معين لهذا الموقع

# noApprovedVolunteersInTeam
source: No approved volunteers available in your team
ar: لا يوجد متطوعون موافق عليهم في فريقك

# assignedVolunteersSuccessfully
source: Assigned {count} volunteers successfully
ar: تم تعيين {count} متطوع بنجاح

# leaveRequestsManagement
source: Leave Requests
ar: طلبات الإجازة

source: Leave request approved
ar: تمت الموافقة على طلب الإجازة

source: Leave request rejected
ar: تم رفض طلب الإجازة

# selectAnEventToViewRequests
source: Select an event to view leave requests
ar: اختر فعالية لعرض طلبات الإجازة

source: Pending Leave Requests
ar: طلبات الإجازة المعلقة

source: No pending leave requests
ar: لا توجد طلبات إجازة معلقة

source: Reason:
ar: السبب:

# requested
source: Requested: {date}
ar: تم الطلب: {date}

source: Volunteer Form
ar: استمارة المتطوع

source: Edit Volunteer Form
ar: تعديل استمارة المتطوع

source: Basic Information
ar: المعلومات الأساسية

source: Contact Information
ar: معلومات الاتصال

source: Professional Information
ar: المعلومات المهنية

source: Document Information
ar: معلومات الوثائق

source: Attachments
ar: المرفقات

# formCreatedSuccessfully
source: Form created successfully! Volunteer can now login.
ar: تم إنشاء النموذج بنجاح! يمكن للمتطوع الآن تسجيل الدخول.

source: Form updated successfully!
ar: تم تحديث النموذج بنجاح!

# imageSizeExceeds500KB
source: Image size should not exceed 500 KB.
ar: يجب ألا يتجاوز حجم الصورة 500 كيلوبايت.

# errorPickingImage
source: Error picking image: {error}
ar: خطأ في اختيار الصورة: {error}

source: Uploading images...
ar: جاري تحميل الصور...

# imageUploaded
source: Image uploaded: {imageName}
ar: تم تحميل الصورة: {imageName}

# errorUploadingImage
source: Error uploading {imageName}: {error}
ar: خطأ في تحميل {imageName}: {error}

source: PDF downloaded successfully!
ar: تم تنزيل ملف PDF بنجاح!

# errorDownloading
source: Error downloading: {error}
ar: خطأ في التنزيل: {error}

# errorPrinting
source: Error printing: {error}
ar: خطأ في الطباعة: {error}

source: Existing image
ar: صورة موجودة

source: Rate Volunteers
ar: تقييم المتطوعين

source: No volunteers found
ar: لم يتم العثور على متطوعين

source: Rate
ar: تقييم

source: Not rated
ar: لم يتم التقييم

# lastRated
source: Last: {date}
ar: آخر تقييم: {date}

# pleaseConfigureCriteriaFirst
source: Please configure rating criteria first
ar: يرجى تكوين معايير التقييم أولاً

source: Rating Criteria
ar: معايير التقييم

source: Notes (Optional)
ar: ملاحظات (اختياري)

# addNote
source: Add a note...
ar: أضف ملاحظة...

source: Save Rating
ar: حفظ التقييم

# ratingSaved
source: Rating saved for {name}
ar: تم حفظ التقييم لـ {name}

# errorSavingRating
source: Error saving rating: {error}
ar: خطأ في حفظ التقييم: {error}

# averageRating
source: Average Rating: {rating} / 5
ar: المتوسط التقييمي: {rating} / 5

source: Manage Rating Criteria
ar: إدارة معايير التقييم

source: No criteria defined
ar: لم يتم تحديد معايير

# clickPlusToAddCriteria
source: Click the + button to add criteria
ar: انقر فوق الزر + لإضافة معايير

source: Add New Criterion
ar: إضافة معيار جديد

source: Criterion Name
ar: اسم المعيار

# criterionPlaceholder
source: e.g., Communication Skills
ar: مثال: مهارات التواصل

# criterionAdded
source: Criterion added. Don't forget to save!
ar: تمت إضافة المعيار. لا تنسَ الحفظ!

source: Edit Criterion
ar: تعديل المعيار

# criterionUpdated
source: Criterion updated. Don't forget to save!
ar: تم تحديث المعيار. لا تنسَ الحفظ!

source: Delete Criterion
ar: حذف المعيار

# confirmDeleteCriterion
source: Are you sure you want to delete "{name}"?
ar: هل أنت متأكد من حذف "{name}"؟

# criterionDeleted
source: Criterion deleted. Don't forget to save!
ar: تم حذف المعيار. لا تنسَ الحفظ!

# cannotSaveEmptyCriteria
source: Cannot save empty criteria list
ar: لا يمكن حفظ قائمة معايير فارغة

# ratingCriteriaSaved
source: Rating criteria saved successfully
ar: تم حفظ معايير التقييم بنجاح

# errorSavingCriteria
source: Error saving criteria: {error}
ar: خطأ في حفظ المعايير: {error}

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Password changed successfully!
ar: تم تغيير كلمة المرور بنجاح!

# passwordMismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# passwordTooShort
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# wrongCurrentPassword
source: Current password is incorrect
ar: كلمة المرور الحالية غير صحيحة

source: Password Security Tips:
ar: نصائح أمان كلمة المرور:

source: Volunteer Management System
ar: نظام إدارة المتطوعين

source: Phone Number
ar: رقم الهاتف

source: Password
ar: كلمة المرور

# enterPhoneNumber
source: Enter your phone number
ar: أدخل رقم هاتفك

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

source: Seed Development Data
ar: بيانات التطوير الأولية

source: Manage System Feedback
ar: إدارة ملاحظات النظام

source: All Feedback
ar: جميع التعليقات

source: In Progress
ar: قيد المعالجة

source: Resolved
ar: تم الحل

source: Feedback Type
ar: نوع الملاحظة

source: Bug Report
ar: تقرير خطأ

source: Feature Request
ar: طلب ميزة

source: Improvement
ar: تحسين

# unknownError
source: An unknown error occurred
ar: حدث خطأ غير معروف

# networkError
source: Network error. Please check your connection.
ar: خطأ في الشبكة. يرجى التحقق من اتصالك.

source: Permission denied
ar: تم رفض الإذن

source: Not found
ar: لم يتم العثور عليه

source: Something went wrong
ar: حدث خطأ ما

source: Language
ar: اللغة

source: Arabic
ar: العربية

source: Switch Language
ar: تبديل اللغة

# languageChanged
source: Language changed successfully
ar: تم تغيير اللغة بنجاح

source: Name
ar: الاسم

source: Phone
ar: الهاتف

source: Email
ar: البريد الإلكتروني

source: Address
ar: العنوان

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Status
ar: الحالة

source: Notes
ar: ملاحظات

source: From
ar: من

source: Team Leader
ar: قائد الفريق

source: Admin
ar: مسؤول

source: All
ar: الكل

source: Unknown
ar: غير معروف

source: Unknown Name
ar: اسم غير معروف

source: No Phone
ar: لا يوجد هاتف

source: Volunteers Management
ar: إدارة المتطوعين

source: Add Volunteer
ar: إضافة متطوع

source: Edit Volunteer
ar: تعديل متطوع

source: Delete Volunteer
ar: حذف متطوع

source: Archive Volunteer
ar: أرشفة متطوع

source: Restore Volunteer
ar: استعادة متطوع

# tapPlusToAddVolunteer
source: Tap + to add a new volunteer
ar: اضغط + لإضافة متطوع جديد

source: Assign Team
ar: تعيين فريق

# selectTeamFor
source: Select a team for {name}:
ar: اختر فريقاً لـ {name}:

source: No team
ar: بدون فريق

# assignedToTeam
source: Assigned {name} to {teamName}
ar: تم تعيين {name} إلى {teamName}

# archiveVolunteerConfirm
source: Archive {name}? This will hide the volunteer but keep their data.
ar: أرشفة {name}؟ سيؤدي هذا إلى إخفاء المتطوع مع الاحتفاظ ببياناته.

source: Archive
ar: أرشفة

source: Restore
ar: استعادة

# restoreVolunteerConfirm
source: Restore {name}?
ar: استعادة {name}؟

# deleteVolunteerConfirm
source: Delete {name} permanently? This action cannot be undone!
ar: حذف {name} نهائياً؟ لا يمكن التراجع عن هذا الإجراء!

# tapPlusToAddTeam
source: Tap + to add a new team
ar: اضغط + لإضافة فريق جديد

source: No members added
ar: لم تتم إضافة أعضاء

source: Add Team Member
ar: إضافة عضو للفريق

source: No volunteers available
ar: لا يوجد متطوعون متاحون

source: Added
ar: تمت الإضافة

# teamLeaderID
source: Team Leader ID: {id}
ar: معرف قائد الفريق: {id}

# tapPlusToAddLocation
source: Tap + to add a new location
ar: اضغط + لإضافة موقع جديد

source: No locations found
ar: لم يتم العثور على مواقع

# latLon
source: Lat: {lat}, Lon: {lon}
ar: خط العرض: {lat}، خط الطول: {lon}

source: Sublocations:
ar: المواقع الفرعية:

# subLocationsColon
source: Sub-locations:
ar: المواقع الفرعية:

source: No sub-locations added
ar: لم تتم إضافة مواقع فرعية

source: Pick Location on Map
ar: اختر الموقع على الخريطة

source: Pick Location
ar: اختيار الموقع

# tapOnMapToSelectLocation
source: Tap on map or drag marker to select location
ar: انقر على الخريطة أو اسحب العلامة لاختيار الموقع

source: Confirm Location
ar: تأكيد الموقع

source: Pick on Map
ar: اختر من الخريطة

# pleaseSelectTeamLeader
source: Please select a team leader
ar: الرجاء اختيار قائد فريق

source: Team
ar: الفريق

# teamColon
source: Team: {name}
ar: الفريق: {name}

# membersColonBold
source: Members:
ar: الأعضاء:

# leaderColon2
source: Leader:
ar: القائد:

# teamLeaderIDColon
source: Team Leader ID: {id}
ar: معرّف قائد الفريق: {id}

# leaderColonWithId
source: Leader: {id}
ar: القائد: {id}

# latLonCoordinates
source: Lat: {lat}, Lon: {lon}
ar: خط العرض: {lat}، خط الطول: {lon}

# subLocationsColon2
source: Sub-locations:
ar: المواقع الفرعية:

source: No sub-locations added
ar: لم تتم إضافة مواقع فرعية

source: Carousel Management
ar: إدارة الشرائح

source: No carousel images yet
ar: لا توجد صور شرائح حتى الآن

# tapPlusToAddFirstImage
source: Tap + to add your first image
ar: اضغط + لإضافة الصورة الأولى

source: Delete Image
ar: حذف الصورة

# areYouSureDeleteImage
source: Are you sure you want to delete "{title}"?
ar: هل أنت متأكد من حذف "{title}"؟

source: Image deleted successfully
ar: تم حذف الصورة بنجاح

source: Error: Could not read file
ar: خطأ: تعذر قراءة الملف
